[
    {
        "path": "documents/chunks/basic_theory_chunk_85.pdf",
        "summary": "BASIC THEORY OF DRIVING 84 PART C EMERGENCY/INCIDENT PROCEDURES (TUNNELS) 266 Escape Route: (a) Fort Canning Tunnel (FCT) and Woodsville Tunnel (WVT) - head for the tunnel entrance or exit , whichever is safer. (b) CTE - head for the escape staircase and cross passage doors within tunnels with walls",
        "keywords": [
            "escape",
            "doors",
            "tunnel",
            "cross",
            "passage"
        ],
        "page_number": "85"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_38.pdf",
        "summary": "BASIC THEORY OF DRIVING 37 PART B SIGNS & SIGNALS Common Road Markings 53 Common road markings ALONG the road. (a) Broken White Line A broken white line is the centre line of a two-way road. Vehicles should keep to the left of this line. (b) Continuous White Line A",
        "keywords": [
            "road",
            "white",
            "line",
            "lines",
            "continuous"
        ],
        "page_number": "38"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_13.pdf",
        "summary": "BASIC THEORY OF DRIVING 12 PART B SIGNS & SIGNALS Prohibitory Signs Width limit (This sign prohibits the entry of vehicles with width in excess of 2.3m. The numerals on the sign may be altered to indicate different width restriction) Height limit (This sign prohibits the entry of vehicles with",
        "keywords": [
            "sign",
            "limit",
            "This",
            "prohibits",
            "entry"
        ],
        "page_number": "13"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_10.pdf",
        "summary": "BASIC THEORY OF DRIVING 9 SIGNS & SIG NALS 33 Traffic signs are erected for 2 main purposes: (a) To regulate traffic movements. (b) To warn and inform road users of hazards or give useful information. MANDATORY SIGNS 34 These are compulsory signs. It is an offence to disobey them.",
        "keywords": [
            "Turn",
            "SIGNS",
            "To",
            "left",
            "signs"
        ],
        "page_number": "10"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_41.pdf",
        "summary": "BASIC THEORY OF DRIVING 40 PART B SIGNS & SIGNALS Common Road Markings Bus Lanes 54 Vehicles other than omnibuses, bicycles, emergency service and police vehicles must avoid using the bus lanes during restricted hours. Non -scheduled buses such as school and factory buses may use the bus lane. However,",
        "keywords": [
            "bus",
            "lane",
            "line",
            "Bus",
            "vehicles"
        ],
        "page_number": "41"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_7.pdf",
        "summary": "BASIC THEORY OF DRIVING 6 PART A DRIVING LICENCE S 23 During the suspension period, the licence holder’s ph otocard driving licence must be surrendered to Traffic Police. For 1st and 2nd suspensions, the licence holder’s photocard driving licence will be returned to him/her upon the expiry of the suspension",
        "keywords": [
            "12",
            "3",
            "suspension",
            "months",
            "points"
        ],
        "page_number": "7"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_58.pdf",
        "summary": "BASIC THEORY OF DRIVING 57 PART B TRAFF IC RULE S & REGULATION S Seat Belts / Lights SEAT BELTS 102 All persons travelling in vehicles, irrespective of their age, should be appropriately belted up. Adults below the height of 1.35m shall use booster seats or approved adjustable seat belts",
        "keywords": [
            "headlights",
            "vehicles",
            "night",
            "S",
            "use"
        ],
        "page_number": "58"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_21.pdf",
        "summary": "BASIC THEORY OF DRIVING 20 PART B SIGNS & SIGNALS Regulatory Signs Detour in the direction indicated One-way traffic (Vehicles may turn right or left) Sharp deviation (Slow down and drive in the direction indicated) Barrier (Slow down and drive carefully) One-way street (One-way street begins from this sign) Curve",
        "keywords": [
            "Slow",
            "drive",
            "direction",
            "indicated",
            "carefully"
        ],
        "page_number": "21"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_89.pdf",
        "summary": "BASIC THEORY OF DRIVING 88 PART C KEY POINTS OF THE MOTOR CLAIMS FRAMEWORK (MCF) 279 In the case of an Accident, you should avoid all unauthorised tow-truck operators or repair workshops. Steps to take: 280 (a) Exchange particulars of involved parties (including Name, NRIC/FIN, Telephone Number, Address and Insurer",
        "keywords": [
            "accident",
            "pictures",
            "Take",
            "reporting",
            "vehicle"
        ],
        "page_number": "89"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_50.pdf",
        "summary": "BASIC THEORY OF DRIVING 49 PART B SIGNS & SIGNALS Hand Signals HAND SIGNALS 61 Before you: (a) Turn or move towards the right/left; (b) Stop or slow down; (c) Pull out from a parking place; or (d) Pull out to pass, give a clear signal and in good time",
        "keywords": [
            "I",
            "intend",
            "move",
            "SIGNALS",
            "slow"
        ],
        "page_number": "50"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_64.pdf",
        "summary": "BASIC THEORY OF DRIVING 63 PART B CODE OF CONDUCT ON THE ROAD General Safe Driving 159 Be careful when driving on steel plates laid on unfinished roadworks because these are extremely slippery, especially when they are wet. 160 Avoid driving through floods as there is a danger that brake",
        "keywords": [
            "road",
            "b",
            "traffic",
            "vehicles",
            "driving"
        ],
        "page_number": "64"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_12.pdf",
        "summary": "BASIC THEORY OF DRIVING 11 PART B SIGNS & SIGNALS Prohibitory Signs PROHIBITORY SIGNS 35 Failure to comply with these signs constitutes an offence. No entry for all vehicles No stopping No waiting (Vehicles may stop to allow boarding or alighting only) No waiting and No loading/unloading during stated hours",
        "keywords": [
            "No",
            "SIGNS",
            "waiting",
            "turn",
            "BASIC"
        ],
        "page_number": "12"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_30.pdf",
        "summary": "BASIC THEORY OF DRIVING 29 PART B SIGNS & SIGNALS Expressway Monitoring and Advisory System s (EMAS) EXPRESSWAY MONITORING AND ADVISORY SYSTEM (EMAS) 45 Motorists should look out for these three types of electr onic signboards when travelling towards and along the expressways ; and selected major arterial roads .",
        "keywords": [
            "travel",
            "time",
            "CTE",
            "displayed",
            "normal"
        ],
        "page_number": "30"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_86.pdf",
        "summary": "BASIC THEORY OF DRIVING 85 PART C ECO -DRIVING: WAYS TO SAVE FUEL AND SAVE THE ENVIRONMENT INTRODUCTION 268 How you drive and treat your vehicle can have a significant impact on fuel consumption and emissions. Practicing eco -driving can reduce fuel consumption by up to 10% on average over",
        "keywords": [
            "vehicle",
            "fuel",
            "reduce",
            "engine",
            "consumption"
        ],
        "page_number": "86"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_54.pdf",
        "summary": "BASIC THEORY OF DRIVING 53 PART B TRAFF IC RULE S & REGULATION S The “Give Way Rule” At Road Junctions / Roundabouts 83 At a junction, look right, then left, then right again. Do not proceed until you are sure that it is safe to do so. Do not",
        "keywords": [
            "right",
            "turn",
            "traffic",
            "lane",
            "left"
        ],
        "page_number": "54"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_52.pdf",
        "summary": "BASIC THEORY OF DRIVING 51 PART B TRAFF IC RULE S & REGULATION S Overtaking 77 Correct method of overtaking - The 12 steps illustrated below show you the correct method of overtaking another vehicle safely. 1 CHECK TRAFFIC AHEAD 2 CHECK TRAFFIC BEHIND 3 SIGNAL RIGHT 4 CHECK BLIND",
        "keywords": [
            "CHECK",
            "SIGNAL",
            "S",
            "method",
            "overtaking"
        ],
        "page_number": "52"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_20.pdf",
        "summary": "BASIC THEORY OF DRIVING 19 SIGNS & SIGNALS Regulatory Signs REGULATORY SIGNS 37 These signs regulate the movements of traffic. Slow down Drive within the speed limit Keep to the left side of the road and leave the outermost right lane for overtaking vehicles Slow down and beware of obstruction",
        "keywords": [
            "Slow",
            "SIGNS",
            "traffic",
            "lane",
            "ahead"
        ],
        "page_number": "20"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_65.pdf",
        "summary": "BASIC THEORY OF DRIVING 64 PART B General Safe Driving / CODE OF CONDUCT ON THE ROAD Safe Driving Technique (Defensive Driving Technique) 168 OVERTAKING (a) Overtake only when it is absolutely necessary. (b) Overtake only when you are sure that there are no other vehicles attempting to pass or",
        "keywords": [
            "vehicle",
            "Do",
            "cyclists",
            "b",
            "vehicles"
        ],
        "page_number": "65"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_68.pdf",
        "summary": "BASIC THEORY OF DRIVING 67 PART B CODE OF CONDUCT ON THE ROAD Safe Driving Technique (Defensive Driving Technique) 194 Switch on your headlights from 7pm to 7am. Drive at a slower speed than you would during the day. 195 When the headlight of an oncoming vehicle dazzles you, look",
        "keywords": [
            "headlight",
            "vehicle",
            "OF",
            "Driving",
            "Technique"
        ],
        "page_number": "68"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_53.pdf",
        "summary": "BASIC THEORY OF DRIVING 52 PART B Road -Hogging / Speed Limits / TRAFF IC RULE S & REGULATION S The “Give Way Rule” At Road Junctions ROAD -HOGGING 78 Road -Hogging is driving at an unreasonably slow speed on the road especially on the right -hand or along the",
        "keywords": [
            "right",
            "traffic",
            "road",
            "Road",
            "speed"
        ],
        "page_number": "53"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_9.pdf",
        "summary": "BASIC THEORY OF DRIVING 8 PART A DRIVING LICENCE S ONLINE PORTALS 31 For more information on driving in Singapore and general road safety, you are encouraged to refer to the following relevant websites: (a) Singapore Police Force https://www.police.gov.sg/Advisories/Traffic/Traffic -Matters (b) Singapore Road Safety Council https://srsc.org.sg (c) Electronics Driver Data",
        "keywords": [
            "https",
            "Singapore",
            "DRIVING",
            "For",
            "information"
        ],
        "page_number": "9"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_32.pdf",
        "summary": "BASIC THEORY OF DRIVING 31 PART B SIGNS & SIGNALS Expressway Monitoring and Advisory Systems (EMAS) (iii) An incident occurs on a flyover or underpass along arterial roads Name of flyover or underpass Right most lane affected Accident Icon (iv) An incident occurs on the road next to a flyover",
        "keywords": [
            "flyover",
            "underpass",
            "An",
            "incident",
            "occurs"
        ],
        "page_number": "32"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_83.pdf",
        "summary": "BASIC THEORY OF DRIVING 82 PART C LANE USE AND VARIABLE MESSAGE SIGNS (LUS) / EMERGENCY FACILITIES (TUNNELS) LANE USE AND VARIABLE MESSAGE SIGNS (LUS) 247 Lane Use Signs are overhead signs in the KPE, CTE, MCE, Woodsville and Fort Canning tunnels which are used to inform motorists of any",
        "keywords": [
            "tunnel",
            "doors",
            "Signs",
            "KPE",
            "MCE"
        ],
        "page_number": "83"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_69.pdf",
        "summary": "BASIC THEORY OF DRIVING 68 PART B CODE OF CONDUCT ON THE ROAD Safe Driving Technique (Defensive Driving Technique) 198 On approaching bends where visibility is poor, use your high beam. This will attract the attention of other road users and warn them of your approach. 199 It is safer",
        "keywords": [
            "road",
            "The",
            "On",
            "OF",
            "ROAD"
        ],
        "page_number": "69"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_63.pdf",
        "summary": "BASIC THEORY OF DRIVING 62 PART B Reversing / Safety of Pedestrians And Cyclists/ CODE OF CONDUCT ON THE ROAD Emergency Vehicles / General Safe Driving REVERSING 141 Before you reverse, make sure that there are no children or other pedestrians or obstructions in the blind areas behind you. 142",
        "keywords": [
            "road",
            "emergency",
            "pedestrians",
            "When",
            "vehicle"
        ],
        "page_number": "63"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_40.pdf",
        "summary": "BASIC THEORY OF DRIVING 39 PART B SIGNS & SIGNALS Common Road Markings (j) School Zone The sections in brick red indicate a school zone . Slow down and look out for children on the road. (k) Yellow Box Do not drive into the yellow box when traffic has come",
        "keywords": [
            "road",
            "The",
            "indicate",
            "traffic",
            "vehicles"
        ],
        "page_number": "40"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_28.pdf",
        "summary": "BASIC THEORY OF DRIVING 27 PART B SIGNS & SIGNALS Directio nal Signs Crime Advisory Secure your bicycle with a strong lock (e.g. U-lock) when left unattended, even if it is only for a short while. Please refer to www.lta.gov.sg/content/ltaweb/en/walk -cycle -ride/rules -and-code -of-conduct.html for more information on the rules",
        "keywords": [
            "Directional",
            "Sign",
            "Confirmation",
            "Advance",
            "Signs"
        ],
        "page_number": "28"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_6.pdf",
        "summary": "BASIC THEORY OF DRIVING 5 PART A DRIVING LICENCE S ‘NEW’ DRIVERS 10 New drivers are motorists who hold a new class of driving licence for less than one year from the date of grant of licence. They shall be under probation for one year from the date of grant",
        "keywords": [
            "suspension",
            "licence",
            "driving",
            "period",
            "year"
        ],
        "page_number": "6"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_16.pdf",
        "summary": "BASIC THEORY OF DRIVING 15 PART B SIGNS & SIGNALS Warning Signs Side road (Slow down. Beware of vehicles from the left) ‘Y’ junction (Slow down. Beware of traffic joining from the right and left) ‘Y’ junction (Slow down. Beware of traffic joining from the right) ‘Y’ junction (Slow down.",
        "keywords": [
            "traffic",
            "Slow",
            "Beware",
            "left",
            "right"
        ],
        "page_number": "16"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_81.pdf",
        "summary": "BASIC THEORY OF DRIVING 80 PART C PARKING IN URA/HDB CAR PARKS 246 (a) Signboards In Housing & Development Board (HDB) Car Parks Car Park Number Car Park Number Night Parking from 10.30pm to 7am (Illuminated Signboard) Coupon Parking from 7am to 10.30pm in Short -Term Parking Lots No Coupon",
        "keywords": [
            "Parking",
            "7am",
            "Coupon",
            "Car",
            "Charges"
        ],
        "page_number": "81"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_70.pdf",
        "summary": "BASIC THEORY OF DRIVING 69 PART B Safe Driving Technique (Defensive Driving Technique) / CODE OF CONDUCT ON THE ROAD Stopping And Moving Off At Traffic Light Junctions 203 When driving round a bend or sharp corner at high speed, your vehicle tends to be pushed out of its path",
        "keywords": [
            "speed",
            "traffic",
            "areas",
            "Traffic",
            "The"
        ],
        "page_number": "70"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_34.pdf",
        "summary": "BASIC THEORY OF DRIVING 33 PART B SIGNS & SIGNALS Expressway Monitoring and Advisory Systems (EMAS) Acronyms Meanings AFT After BEF Before LN Lane SH Shoulder VEH Vehicle Common EMAS Acronyms Event (Drive with Care. Beware of event on road. Expect delays) Running Event (Drive with care. Beware of running",
        "keywords": [
            "Event",
            "Drive",
            "Beware",
            "event",
            "road"
        ],
        "page_number": "34"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_46.pdf",
        "summary": "BASIC THEORY OF DRIVING 45 PART B SIGNS & SIGNALS Signals (Traffic Lights) GREEN ‘B’ Means “GO” for all buses only. This is to allow them to move out of a bus -bay or a side lane and proceed ahead of other vehicles. ADVANCED WARNING LIGHTS A signal with two",
        "keywords": [
            "Means",
            "direction",
            "ahead",
            "ARROW",
            "indicated"
        ],
        "page_number": "46"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_22.pdf",
        "summary": "BASIC THEORY OF DRIVING 21 PART B SIGNS & SIGNALS Information Signs INFORMATION SIGNS 38 These signs provide useful information to motorists. No through road (Road on the right does not lead to another road) No through road (Road ends in a short distance) ‘Terminus’ with ‘Terminal’ (For buses only)",
        "keywords": [
            "Bus",
            "No",
            "road",
            "For",
            "stop"
        ],
        "page_number": "22"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_42.pdf",
        "summary": "BASIC THEORY OF DRIVING 41 PART B SIGNS & SIGNALS Common Road Markings (c) Bus Priority Box (also known as Mandatory Give -Way to Buses) The section in yellow indicates a mandatory give-way to buses area. Slow down and watch out for buses pulling out of the bus bay. Stop",
        "keywords": [
            "buses",
            "bus",
            "Bus",
            "bay",
            "give"
        ],
        "page_number": "42"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_23.pdf",
        "summary": "BASIC THEORY OF DRIVING 22 PART B SIGNS & SIGNALS Information Signs U-turn facility ahead (Vehicles should U-turn after the sign) Three turning lanes ahead (Signal and filter to the correct lane) U-turn sign with vehicle weight restriction (U-turn ahead for vehicles not exceeding the weight limit as stated on",
        "keywords": [
            "Give",
            "ahead",
            "buses",
            "waiting",
            "sign"
        ],
        "page_number": "23"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_45.pdf",
        "summary": "BASIC THEORY OF DRIVING 44 PART B SIGNS & SIGNALS Signals (Traffic Lights) SIGNALS (TRAFFIC LIGHTS) 58 Traffic Lights RED Means “STOP”. ALL RED Some junctions have an ALL RED period for safety or for pedestrians to cross. This means that all the approaches are simultaneously showing the red signals.",
        "keywords": [
            "Means",
            "RED",
            "AMBER",
            "stop",
            "traffic"
        ],
        "page_number": "45"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_72.pdf",
        "summary": "BASIC THEORY OF DRIVING 71 PART B PARTS AND CONTROLS OF A CAR Front View / Rear View (j) Battery Keep the battery and its terminals clean. Make sure that the connections at the terminals are securely tightened. Check the level of the battery water if your battery is not",
        "keywords": [
            "battery",
            "water",
            "level",
            "OF",
            "View"
        ],
        "page_number": "72"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_33.pdf",
        "summary": "BASIC THEORY OF DRIVING 32 PART B SIGNS & SIGNALS Expressway Monitoring and Advisory Systems (EMAS) EMAS SIGNS 46 Motorist should also be familiar with most of the traffic symbols used on the EMAS signboards. Some of the more commonly displayed ones are listed below. In addition, lanes are numbered",
        "keywords": [
            "Drive",
            "lane",
            "Slow",
            "carefully",
            "road"
        ],
        "page_number": "33"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_17.pdf",
        "summary": "BASIC THEORY OF DRIVING 16 PART B SIGNS & SIGNALS Warning Signs Road narrows on one side (Slow down. Do not overtake, make a U-turn or park your vehicle) Road narrows on both sides (Slow down. Do not overtake, make a U -turn or park your vehicle) Dual -carriageway ends",
        "keywords": [
            "Slow",
            "ahead",
            "Road",
            "traffic",
            "narrows"
        ],
        "page_number": "17"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_87.pdf",
        "summary": "BASIC THEORY OF DRIVING 86 PART C ECO -DRIVING: WAYS TO SAVE FUEL AND SAVE THE ENVIRONMENT (c) Drive Smoothly (i) Avoid dragging the engine by using the correct gear if you drive a manual vehicle. Driving the vehicle in the right gear will increase fuel efficiency and reduce emissions",
        "keywords": [
            "vehicle",
            "fuel",
            "reduce",
            "speed",
            "Drive"
        ],
        "page_number": "87"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_2.pdf",
        "summary": "BASIC THEORY OF DRIVING 1 BASIC THEORY OF DRIVING THE OFFICIAL HANDBOOK Basic Theory of Driving is published by © Singapore Traffic Police. No part of this publication may be reproduced, stored in a retrieval system, or transmitted in any form or by any means, electronic, mechanical, photocopying, recording or",
        "keywords": [
            "Signs",
            "Driving",
            "Traffic",
            "3",
            "Singapore"
        ],
        "page_number": "2"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_3.pdf",
        "summary": "BASIC THEORY OF DRIVING 2 CONTENTS Height Limits 58 Use Of Mobile Communication Device While Driving 59 CODE OF CONDUCT ON THE ROAD Moving Off 60 Mirrors And Signals 60 Driving Along 60 Tailgating 60 Safe Following Distance 60 The ‘Two -Second’ Rule 61 Stopping Distance 61 Reversing 62 Safety",
        "keywords": [
            "Driving",
            "60",
            "OF",
            "62",
            "Zone"
        ],
        "page_number": "3"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_14.pdf",
        "summary": "BASIC THEORY OF DRIVING 13 PART B SIGNS & SIGNALS Prohibitory Signs Speed limit (Do not exceed 40 km/h) Speed limit (Do not exceed 50 km/h) Speed limit (Do not exceed 60 km/h) Speed limit (Do not exceed 70 km/h) Speed limit (Do not exceed 80 km/h) Speed limit (Do",
        "keywords": [
            "Speed",
            "limit",
            "Do",
            "exceed",
            "No"
        ],
        "page_number": "14"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_55.pdf",
        "summary": "BASIC THEORY OF DRIVING 54 PART B TRAFF IC RULE S & REGULATION S Driving O n Expressways / Yellow -Box Junctions DRIVING ON EXPRESSWAYS 91 Do not drive, move or stop on road shoulder or verge unless in the event of a breakdown, accident or emergency. 92 Vehicles which",
        "keywords": [
            "vehicles",
            "B",
            "marked",
            "yellow",
            "box"
        ],
        "page_number": "55"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_71.pdf",
        "summary": "BASIC THEORY OF DRIVING 70 PART B CODE OF CONDUCT ON THE ROAD Roadworthiness STOPPING AND MOVING OFF AT TRAFFIC LIGHT JUNCTIONS 209 (a) WHEN STOPPING DO’s DON’Ts 1. Stop before and close to the stop -line. 2. Leave a safety gap of 2 metres between your vehicle and the",
        "keywords": [
            "vehicle",
            "lights",
            "2",
            "Stop",
            "front"
        ],
        "page_number": "71"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_5.pdf",
        "summary": "BASIC THEORY OF DRIVING 4 Class 4A Omnibuses - For public service vehicles which are used on scheduled services and in which passengers are charged separate and distinct fares. Be at least 21 years old and in possession of a class 3 Qualified Licence. Class 4 Heavy motor cars of",
        "keywords": [
            "driving",
            "Test",
            "must",
            "pass",
            "Driving"
        ],
        "page_number": "5"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_66.pdf",
        "summary": "BASIC THEORY OF DRIVING 65 PART B CODE OF CONDUCT ON THE ROAD Safe Driving Technique (Defensive Driving Technique) SAFE DRIVING TECHNIQUE (DEFENSIVE DRIVING TECHNIQUE) 175 Safe/Defensive driving technique: Driving safely and competently demands the total involvement of most of your senses. It is not enough to gain physical mastery",
        "keywords": [
            "conditions",
            "driving",
            "road",
            "vehicle",
            "affect"
        ],
        "page_number": "66"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_27.pdf",
        "summary": "BASIC THEORY OF DRIVING 26 PART B SIGNS & SIGNALS Signs For Pedal -Cycles SIGNS FOR PEDAL -CYCLES 41 Pedal cyclists should obey these signs. No entry for bicycles Bicycle stand No entry for pedestrians and pedal -cycles No parking of bicycles This sign prohibits the riding of pedal -cycles",
        "keywords": [
            "riding",
            "bicycles",
            "Bicycle",
            "must",
            "Power"
        ],
        "page_number": "27"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_35.pdf",
        "summary": "BASIC THEORY OF DRIVING 34 PART B SIGNS & SIGNALS Facilities Signs / Vehicle Markings FACILITY SIGNS 47 Facility signs give motorists information of facilities and the direction to take to get to them. These signs have black letters on white backgrounds with black borders. 48 Directions leading to places",
        "keywords": [
            "vehicles",
            "white",
            "vehicle",
            "speed",
            "signs"
        ],
        "page_number": "35"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_39.pdf",
        "summary": "BASIC THEORY OF DRIVING 38 PART B SIGNS & SIGNALS Common Road Markings (d) Unbroken Yellow Line An unbroken yellow line indicates no parking between 7.00am and 7.00pm on that side of the road where the line is drawn, except on Sundays and public holidays. (e) Unbroken Double Yellow Lines",
        "keywords": [
            "line",
            "road",
            "Yellow",
            "Line",
            "yellow"
        ],
        "page_number": "39"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_36.pdf",
        "summary": "BASIC THEORY OF DRIVING 35 PART B SIGNS & SIGNALS Common Road Markings COMMON ROAD MARKINGS 52 Common road markings ACROSS the road. (a) Parallel Broken White Lines Parallel broken white lines indicate that traffic approaching these lines must give way to traffic on a major road. (b) Single White",
        "keywords": [
            "Parallel",
            "road",
            "White",
            "white",
            "lines"
        ],
        "page_number": "36"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_80.pdf",
        "summary": "BASIC THEORY OF DRIVING 79 PARKING IN URA/HDB CAR PARKS 244 Coupon Parking System (a) Please read the car park signboard carefully when parking your vehicle at any HDB or URA car park. Besides the car park signboard, motorists are advised to look out for other parking restrictions signs within",
        "keywords": [
            "parking",
            "car",
            "park",
            "Parking",
            "Coupon"
        ],
        "page_number": "80"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_48.pdf",
        "summary": "BASIC THEORY OF DRIVING 47 PART B SIGNS & SIGNALS Signals Given By A Police Officer SIGNALS GIVEN BY A POLICE OFFICER 60 Signals given by Police Officers directing traffic take precedence over those conveyed by road signs, traffic light signals, road markings and traffic regulations. (a) Vehicles approaching Police",
        "keywords": [
            "Police",
            "Vehicles",
            "approaching",
            "Officer",
            "traffic"
        ],
        "page_number": "48"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_18.pdf",
        "summary": "BASIC THEORY OF DRIVING 17 PART B SIGNS & SIGNALS Warning Signs Vehicle breakdown sign (To be placed at least 20 metres from the rear of the vehicle) Slippery road (Slow down. Drive carefully) Gated level crossing (Slow down. Beware of gate closing) Ungated level crossing (Slow down. Beware of",
        "keywords": [
            "Slow",
            "Keep",
            "left",
            "Do",
            "overtake"
        ],
        "page_number": "18"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_25.pdf",
        "summary": "BASIC THEORY OF DRIVING 24 PART B SIGNS & SIGNALS Pedestrian Crossing Signs PEDESTRIAN CROSSING SIGNS 39 Pedestrians should obey these signs when crossing the road. Pedestrian overpass Pedestrian underpass Designated pedestrian crossing Pedestrian signal ‘Red Man’ (Do not cross) Pedestrian signal ‘Green Man’ (You may cross but do not",
        "keywords": [
            "Pedestrian",
            "crossing",
            "cross",
            "road",
            "SIGNS"
        ],
        "page_number": "25"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_88.pdf",
        "summary": "BASIC THEORY OF DRIVING 87 PART C SECURITY MEASURES TO PREVENT THEFT OF/FROM MOTOR VEHICLES INTRODUCTION 271 Motor vehicle theft (MVT) and theft from vehicle (TFV) are two of the Police’s key crime concerns. The majority of these case s take place in carparks located in public housing estates. 272",
        "keywords": [
            "vehicle",
            "lock",
            "motorcycle",
            "theft",
            "car"
        ],
        "page_number": "88"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_76.pdf",
        "summary": "BASIC THEORY OF DRIVING 75 PART B DRIVING IN S PECIAL ZONES School Zone / Silver Zone SCHOOL ZONE SAFETY 219 Children are vulnerable road users with limited experience using the roads, thus it is of paramount importance to keep school zones safe. ROAD SAFETY MEASURES 220 Several road engineering",
        "keywords": [
            "road",
            "school",
            "Silver",
            "zones",
            "measures"
        ],
        "page_number": "76"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_4.pdf",
        "summary": "BASIC THEORY OF DRIVING 3 PART A DRIVING LICENCES INTRODUCTION The “Basic Theory of Driving” handbook is essential reading for all road users in Singapore, which comprise the pedestrians, cyclists, motorcyclists and drivers. It covers The Highway Code, which includes the traffic rules, traffic regulations, traffic signs and signals, and",
        "keywords": [
            "Class",
            "exceeding",
            "motor",
            "driving",
            "Must"
        ],
        "page_number": "4"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_47.pdf",
        "summary": "BASIC THEORY OF DRIVING 46 PART B SIGNS & SIGNALS Signals (Traffic Lights) / Signals (On the Road) EXAMPLES Means “GO” for straight ahead vehicles and “GO” for right turn vehicles. Means “GO” for straight ahead vehicles only. Vehicles turning right must get ready to “STOP”. Means “GO” for straight",
        "keywords": [
            "vehicles",
            "Road",
            "GO",
            "Means",
            "straight"
        ],
        "page_number": "47"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_78.pdf",
        "summary": "BASIC THEORY OF DRIVING 77 PART B AUTONOMOUS VEHICLE (AV) INTRODUCTION 231 An AV is a vehicle that can drive from a starting location to a pre -determined destination using various technologies and sensors to sense its environment and navigate in autonomous mode. 232 As part of the long -term",
        "keywords": [
            "AV",
            "vehicle",
            "road",
            "driving",
            "safe"
        ],
        "page_number": "78"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_44.pdf",
        "summary": "BASIC THEORY OF DRIVING 43 PART B SIGNS & SIGNALS Directi on Arrows / Merging Arrow Markings DIRECTION ARROWS 56 You should only proceed in the directions shown by the arrows. MERGING ARROW MARKINGS 57 Merging arrows are drawn on the road to give motorists advance warning that two traffic",
        "keywords": [
            "Merging",
            "arrows",
            "two",
            "traffic",
            "lanes"
        ],
        "page_number": "44"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_49.pdf",
        "summary": "BASIC THEORY OF DRIVING 48 PART B SIGNS & SIGNALS Signals Given By A Police Officer (d) (i) Vehicles approaching Police Officer from front and behind to stop . (ii) Vehicles approaching from his/her right may proceed. Vehicles approaching from his/her left be ready to stop - signal is about",
        "keywords": [
            "Vehicles",
            "approaching",
            "stop",
            "Police",
            "Officer"
        ],
        "page_number": "49"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_57.pdf",
        "summary": "BASIC THEORY OF DRIVING 56 PART B TRAFF IC RULE S & REGULATION S U-Turns / Stopping And Parking U-TURNS 95 Do not make a U-turn at any road intersection, junction or any opening in a road divider except where a U -turn sign is located. 96 Always negotiate a",
        "keywords": [
            "road",
            "vehicle",
            "except",
            "traffic",
            "Within"
        ],
        "page_number": "57"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_84.pdf",
        "summary": "BASIC THEORY OF DRIVING 83 PART C EMERGENCY/INCIDENT PROCEDURES (TUNNELS) 258 Radio break -in is an important tool for the OCC to communicate with motorists in the tunnel during an emergency and as a good driving habit, motorists are encouraged to tune into an FM radio channel before entering the",
        "keywords": [
            "tunnel",
            "emergency",
            "fire",
            "vehicle",
            "LTA"
        ],
        "page_number": "84"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_15.pdf",
        "summary": "BASIC THEORY OF DRIVING 14 PART B SIGNS & SIGNALS Warning Signs WARNING SIGNS 36 Take extra care, slow down as you approach these signs. Right bend (Slow down. Keep left. Do not overtake, make a U -turn or park your vehicle) Left bend (Slow down. Keep left. Do not",
        "keywords": [
            "Slow",
            "left",
            "Keep",
            "Do",
            "overtake"
        ],
        "page_number": "15"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_61.pdf",
        "summary": "BASIC THEORY OF DRIVING 60 PART B Moving Off / Mirrors And Signals / CODE OF CONDUCT ON THE ROAD Driving Along / Tailgating / Safe Following Distance MOVING OFF 129 Before you move off, fasten your seat belt and look in the mirrors. Give the proper signal, look around",
        "keywords": [
            "vehicle",
            "road",
            "Tailgating",
            "look",
            "mirrors"
        ],
        "page_number": "61"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_37.pdf",
        "summary": "BASIC THEORY OF DRIVING 36 PART B SIGNS & SIGNALS Common Road Markings (e) Raised Zebra Crossing Slow down and stop if there are pedestrians or cyclists crossing or about to cross. Beware of raised hump. (f) Hump Slow down. (g) Bus -Friendly Hump Slow down.",
        "keywords": [
            "Slow",
            "Hump",
            "BASIC",
            "THEORY",
            "OF"
        ],
        "page_number": "37"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_1.pdf",
        "summary": "",
        "keywords": [],
        "page_number": "1"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_75.pdf",
        "summary": "BASIC THEORY OF DRIVING 74 PART B WORK ZONES Work Zone Signs Work Access Ahead Left Bend Ahead Right Bend Ahead Lateral Shift Marker (Indicates a lateral change of direction) Series of Bends Ahead Shoulder Lane Closed Ahead Pedestrian Path Indicates Location (To supplement another sign) Distance Supplementary Plate (To",
        "keywords": [
            "Work",
            "Ahead",
            "Zone",
            "Bend",
            "Indicates"
        ],
        "page_number": "75"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_60.pdf",
        "summary": "BASIC THEORY OF DRIVING 59 PART B TRAFF IC RULE S & REGULATION S Use Of Mobile Communication Device While Driving USE OF MOBILE COMMUNICATION DEVICE WHILE DRIVING (“Use”, in relation to a mobile communication device , means to hold it in at least one hand while operating any of",
        "keywords": [
            "mobile",
            "device",
            "communication",
            "driving",
            "using"
        ],
        "page_number": "60"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_74.pdf",
        "summary": "BASIC THEORY OF DRIVING 73 PART B Road Users At Work Zones / WORK ZONES Work Zone Signs ROAD USERS AT WORK ZONES Motorists, Motorcyclists or Cyclists 211 Take special care to watch out for the warning of the work activity and the obstruction ahead. Be alert of the traffic",
        "keywords": [
            "work",
            "traffic",
            "signs",
            "zone",
            "area"
        ],
        "page_number": "74"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_67.pdf",
        "summary": "BASIC THEORY OF DRIVING 66 PART B CODE OF CONDUCT ON THE ROAD Safe Driving Technique (Defensive Driving Technique) 186 On a rainy day, a thin layer of water forms on the road surface. Even good tyres may not have a good grip on the road. As speed increases, surface",
        "keywords": [
            "water",
            "road",
            "vehicle",
            "braking",
            "surface"
        ],
        "page_number": "67"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_8.pdf",
        "summary": "BASIC THEORY OF DRIVING 7 PART A DRIVING LICENCE S S/No. Offences Committed Demerit Points 15 Exceeding the speed limit of a vehicle by 1 to 20 kilometres per hour 4 16 Exceeding the speed limit of a road by 1 to 20 kilometres per hour 4 17 Failing to",
        "keywords": [
            "4",
            "vehicle",
            "Exceeding",
            "speed",
            "limit"
        ],
        "page_number": "8"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_31.pdf",
        "summary": "BASIC THEORY OF DRIVING 30 PART B SIGNS & SIGNALS Expressway Monitoring and Advisory Systems (EMAS) (b) TRAFFIC INFORMATION DISPLAY (TID) ON EXPRESSWAYS / SELECTED MAJOR ARTERIAL ROADS These large displays found along the expressways and selected major arterial roads display traffic information in text and simple graphic display up",
        "keywords": [
            "closure",
            "traffic",
            "information",
            "exit",
            "ahead"
        ],
        "page_number": "31"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_77.pdf",
        "summary": "BASIC THEORY OF DRIVING 76 PART B DRIVING IN TUNNELS Daily Driving Rules (g) 3D road markings to narrow lane width virtually and reduce vehicles’ travel speeds. DRIVING IN SILVER ZONES 226 (a) Drive s low and carefully w ithin silver zones, especially when approaching crossings . (b) Be extra",
        "keywords": [
            "Do",
            "Vehicle",
            "vehicle",
            "carrying",
            "b"
        ],
        "page_number": "77"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_19.pdf",
        "summary": "BASIC THEORY OF DRIVING 18 PART B SIGNS & SIGNALS Warning Signs Animals (Slow down. Beware of animals) Low flying aircraft ahead (Beware of sudden noise from low flying aircraft) Raised zebra crossing ahead (Slow down. Stop for pedestrians to cross at the raised zebra crossing) Elderly or handicapped pedestrians",
        "keywords": [
            "ahead",
            "Slow",
            "Beware",
            "crossing",
            "road"
        ],
        "page_number": "19"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_79.pdf",
        "summary": "BASIC THEORY OF DRIVING 78 PART B ELECTRIC MOTORCYCLE (EM) INTRODUCTION 237 Electric powered motorcycles and scooters are plug -in-electric vehicles with two or three wheels. The electricity is stored on board in a rechargeable battery, which drives one or more electric motors. 238 Electric powered motorcycles and scooters are",
        "keywords": [
            "motorcycles",
            "Class",
            "electric",
            "The",
            "Electric"
        ],
        "page_number": "79"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_26.pdf",
        "summary": "BASIC THEORY OF DRIVING 25 PART B SIGNS & SIGNALS Traffic Signs For Tunnels TRAFFIC SIGNS FOR TUNNELS 40 Traffic using the tunnel should heed and obey these signs. Tunnel Ahead (The stretch of road ahead is in a tunnel) Vehicles carrying dangerous goods are not allowed in the tunnels",
        "keywords": [
            "The",
            "lane",
            "SIGNS",
            "Traffic",
            "tunnel"
        ],
        "page_number": "26"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_59.pdf",
        "summary": "BASIC THEORY OF DRIVING 58 PART B Lights / Alcohol / TRAFF IC RULE S & REGULATION S Light Goods Vehicles / Height Limits 109 In the daytime whenever visibility is poor or if it is raining, switch on your headlights. This is to enable other road users to see",
        "keywords": [
            "vehicle",
            "workers",
            "The",
            "deck",
            "height"
        ],
        "page_number": "59"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_62.pdf",
        "summary": "BASIC THEORY OF DRIVING 61 PART B CODE OF CONDUCT ON THE ROAD The ‘Two -Second’ Rule / Stopping Distance THE ‘TWO -SECOND’ RULE 137 A simple way to ensure a safe gap between you and the vehicle in front is to use the ‘two -second’ rule. As the vehicle",
        "keywords": [
            "distance",
            "vehicle",
            "front",
            "one",
            "A"
        ],
        "page_number": "62"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_73.pdf",
        "summary": "BASIC THEORY OF DRIVING 72 PART B The Instrument Panel (Dashboard) / PART S AND CONTROLS OF A CAR Names Of Various Driving Controls THE INSTRUMENT PANEL (DASHBOARD) 1 Temperature Gauge 8 Door Ajar Warning Light 2 Speedometer 9 Battery Warning Light 3 Odometer 10 Hand Brake Indicator 4 Tripmeter",
        "keywords": [
            "Light",
            "Indicator",
            "OF",
            "Warning",
            "Pedal"
        ],
        "page_number": "73"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_82.pdf",
        "summary": "BASIC THEORY OF DRIVING 81 PART C PARKING IN URA/HDB CAR PARKS (c) Line Markings For Parking Lots Lots Demarcated in Red • Reserved for Season Parking Ticket Holders Lots Demarcated in White • For car parks outside the Restricted Zone • Coupon parking allowed • Refer to signboard located",
        "keywords": [
            "parking",
            "Lots",
            "car",
            "hours",
            "Demarcated"
        ],
        "page_number": "82"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_24.pdf",
        "summary": "BASIC THEORY OF DRIVING 23 PART B SIGNS & SIGNALS Information Signs Start of expressway (Vehicles should comply with the Expressway Rules after this point) End of expressway (Vehicles should slow down and drive within the speed limit of the road) Rain shelter for motorcyclists Any vehicle parked in this",
        "keywords": [
            "zone",
            "End",
            "expressway",
            "Vehicles",
            "road"
        ],
        "page_number": "24"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_11.pdf",
        "summary": "BASIC THEORY OF DRIVING 10 PART B SIGNS & SIGNALS Mandatory Signs Stop (Stop before the white line. Give way to traffic from the right and left) Stop for children to cross the road Left Turn on Red • Stop at the red light • Give way to pedestrians crossing",
        "keywords": [
            "Stop",
            "Give",
            "way",
            "traffic",
            "right"
        ],
        "page_number": "11"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_56.pdf",
        "summary": "BASIC THEORY OF DRIVING 55 PART B TRAFF IC RULE S & REGULATION S Yellow -Box Junctions (b) Situation Two The second situation is when motorists are waiting in the yellow box while trying to turn right in the face of oncoming traff ic. Drivers of vehicles marked A, B",
        "keywords": [
            "box",
            "yellow",
            "B",
            "The",
            "turn"
        ],
        "page_number": "56"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_43.pdf",
        "summary": "BASIC THEORY OF DRIVING 42 PART B SIGNS & SIGNALS Common Road Markings 55 Common road markings ON the road. (a) Zig -Zag Lines by Side of the Road Zig-zag lines by the side of the road give advance warning of the presence of a Pedestrian Crossing. The white zig",
        "keywords": [
            "road",
            "lines",
            "Crossing",
            "Markings",
            "markings"
        ],
        "page_number": "43"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_29.pdf",
        "summary": "BASIC THEORY OF DRIVING 28 PART B SIGNS & SIGNALS Directio nal Signs Additional information on some directional signs have black letters on white backgrounds with black borders. The sign provides information on the road that you are approaching. 44 On all roads leading to destinations along roads other than",
        "keywords": [
            "white",
            "information",
            "signs",
            "black",
            "letters"
        ],
        "page_number": "29"
    },
    {
        "path": "documents/chunks/basic_theory_chunk_51.pdf",
        "summary": "BASIC THEORY OF DRIVING 50 PART B TRAFF IC RULE S & REGULATION S The Keep -Left Rules / Lane Discipline / Overtaking THE KEEP -LEFT RULE 62 When driving along two -way streets, keep well to the left and as near as practicable to the boundary of the road,",
        "keywords": [
            "When",
            "road",
            "overtake",
            "right",
            "lane"
        ],
        "page_number": "51"
    }
]